package iransystem

import "strings"

func DecodeBytes(bytes []byte) (string, error) {
	var sb strings.Builder

	for i := len(bytes) - 1; i >= 0; i-- {
		if _, err := sb.WriteRune(DecodeChar(uint8(bytes[i]))); err != nil {
			return "", err
		}
	}

	return sb.String(), nil
}

func DecodeChar(c uint8) rune {
	if c < uint8(0x80) {
		return rune(c)
	}

	return utf8List[c-0x80]
}

var utf8List = [128]rune{
	'۰', '۱', '۲', '۳', '۴', '۵', '۶', '۷', '۸', '۹', '،', 'ـ', '؟', 'ﺁ', 'ﺋ', 'ﺀ',
	'ﺍ', 'ﺎ', 'ﺏ', 'ﺑ', 'ﭖ', 'ﭘ', 'ﺕ', 'ﺗ', 'ﺙ', 'ﺛ', 'ﺝ', 'ﺟ', 'ﭺ', 'ﭼ', 'ﺡ', 'ﺣ',
	'ﺥ', 'ﺧ', 'ﺩ', 'ﺫ', 'ﺭ', 'ﺯ', 'ﮊ', 'ﺱ', 'ﺳ', 'ﺵ', 'ﺷ', 'ﺹ', 'ﺻ', 'ﺽ', 'ﺿ', 'ﻁ',
	'░', '▒', '▓', '│', '┤', '╡', '╢', '╖', '╕', '╣', '║', '╗', '╝', '╜', '╛', '┐',
	'└', '┴', '┬', '├', '─', '┼', '╞', '╟', '╚', '╔', '╩', '╦', '╠', '═', '╬', '╧',
	'╨', '╤', '╥', '╙', '╘', '╒', '╓', '╫', '╪', '┘', '┌', '█', '▄', '▌', '▐', '▀',
	'ﻅ', 'ﻉ', 'ﻊ', 'ﻌ', 'ﻋ', 'ﻍ', 'ﻎ', 'ﻐ', 'ﻏ', 'ﻑ', 'ﻓ', 'ﻕ', 'ﻗ', 'ﮎ', 'ﮐ', 'ﮒ',
	'ﮔ', 'ﻝ', 'ﻻ', 'ﻟ', 'ﻡ', 'ﻣ', 'ﻥ', 'ﻧ', 'ﻭ', 'ﻩ', 'ﻬ', 'ﻫ', 'ﯽ', 'ﯼ', 'ﯾ', 0x00A0,
}
